/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: bjimenez <bjimenez@student.42malaga.com    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/02 14:09:39 by bjimenez          #+#    #+#             */
/*   Updated: 2023/12/11 08:47:07 by bjimenez         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Server.hpp"
#include "SrvConfigFile.hpp"
#include "CGIexec.hpp"
#include <iostream>

void	leaks(void)
{
	system("leaks webserv");
}

void	CloseProgram(int signal)
{
	if (signal == 2)
	{
		std::cout << "\n\n<-_-_-🍋🍋\tBye From yogurdelimon\t🍋🍋-_-_->\n\n";
		std::cout << "\t⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⣀⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀"<<std::endl
					<<"\t⠀⠀⠀⠀⠀⢀⣀⣠⣤⣴⣶⡶⢿⣿⣿⣿⠿⠿⠿⠿⠟⠛⢋⣁⣤⡴⠂⣠⡆⠀"<<std::endl
					<<"\t⠀⠀⠀⠀⠈⠙⠻⢿⣿⣿⣿⣶⣤⣤⣤⣤⣤⣴⣶⣶⣿⣿⣿⡿⠋⣠⣾⣿⠁⠀"<<std::endl
					<<"\t⠀⠀⠀⠀⠀⢀⣴⣤⣄⡉⠛⠻⠿⠿⣿⣿⣿⣿⡿⠿⠟⠋⣁⣤⣾⣿⣿⣿⠀⠀"<<std::endl
					<<"\t⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣶⣶⣤⣤⣤⣤⣤⣤⣶⣾⣿⣿⣿⣿⣿⣿⣿⡇⠀"<<std::endl
					<<"\t⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀"<<std::endl
					<<"\t⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀"<<std::endl
					<<"\t⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⢸⡟⢸⡟⠀⠀"<<std::endl
					<<"\t⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣷⡿⢿⡿⠁⠀⠀"<<std::endl
					<<"\t⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢁⣴⠟⢀⣾⠃⠀⠀⠀"<<std::endl
					<<"\t⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠛⣉⣿⠿⣿⣶⡟⠁⠀⠀⠀⠀"<<std::endl
					<<"\t⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⣿⣏⣸⡿⢿⣯⣠⣴⠿⠋⠀⠀⠀⠀⠀⠀"<<std::endl
					<<"\t⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⠿⠶⣾⣿⣉⣡⣤⣿⠿⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀"<<std::endl
					<<"\t⠀⠀⢸⣿⣿⣿⣿⡿⠿⠿⠿⠶⠾⠛⠛⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"<<std::endl
					<<"\t⠀⠀⠈⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀"<<std::endl;

		exit(0);
	}
}

void init_cluster(SrvConfigFile &cfg)
{
	Server firstserver(cfg);

	firstserver.init_socket();
	firstserver.init_listen();
}

int	main(int argc, char	**argv)
{
	SrvConfigFile	cfg;
	
	//atexit(leaks);
	signal(SIGINT, CloseProgram);

	if (argc > 2)
		return (std::cout << "Error\nInvalid config!!\n", 1);
	else if (argc == 2)
	{
		SrvConfigFile infile(argv[1]);
		cfg = infile;
		std::cout << std::endl << argv[1] << " config file set!\n\n";
	}
	else
		std::cout << "\nDefault config file set!\n\n";
	init_cluster(cfg);

	return (0);
}
